//Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
//и на выходе показывает вторую цифру этого числа.

// Console.WriteLine ("Введите трехзначное число: ") ;
// int number = Convert.ToInt32(Console.ReadLine());
// int Digit2 = (number%100)/10;
// Console.WriteLine ($"Вторая цифра -{Digit2}");



// Задача 13: Напишите программу, которая выводит третью цифру заданного числа 
//или сообщает, что третьей цифры нет.


// Console.WriteLine ("Введите число: ") ;
// string number = Convert.ToString(Console.ReadLine());
// if (number.Length< 3) 
// Console.WriteLine ($"Третьей цифры нет");
// else Console.WriteLine ($"Третья цифра числа -{number[2]}");



// Задача 15: Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine ("Введите число: ") ;
// int  DateNumber = Convert.ToInt32(Console.ReadLine());
// if (DateNumber > 0 && DateNumber < 6) 
// Console.WriteLine ($"Нет");
// else Console.WriteLine ($"Выходной!");